drone-os/drone-tisl-map/svd_files/CC2538.svd
        <register>
          <name>FSMSTAT0</name>
          <description>Radio status register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CAL_DONE</name>
              <description>Frequency synthesis calibration has been performed since the last time the FS was turned on.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CAL_RUNNING</name>
              <description>Frequency synthesis calibration status 0: Calibration is complete or not started. 1: Calibration is in progress. </description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FSM_FFCTRL_STATE</name>
              <description>Gives the current state of the FIFO and frame control (FFCTRL) finite state-machine. </description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSMSTAT1</name>
          <description>Radio status register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFO</name>
              <description>FIFO is high when there is data in the RX FIFO. FIFO is low during RX FIFO overflow.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOP</name>
              <description>FIFOP is set high when there are at more than FIFOP_THR bytes of data in the RX FIFO that has passed frame filtering. FIFOP is set high when there is at least one complete frame in the RX FIFO. FIFOP is high during RX FIFO overflow. </description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SFD</name>
              <description>In TX 0: When a complete frame with SFD was sent or no SFD was sent 1: SFD was sent. In RX 0: When a complete frame was received or no SFD was received 1: SFD was received.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CCA</name>
              <description>Clear channel assessment Dependent on CCA_MODE settings. See CCACTRL1 for details.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAMPLED_CCA</name>
              <description>Contains a sampled value of the CCA The value is updated when a SSAMPLECCA or STXONCCA strobe is issued.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCK_STATUS</name>
              <description>1 when PLL is in lock; otherwise 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_ACTIVE</name>
              <description>Status signal Active when FFC is in one of the transmit states</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_ACTIVE</name>
              <description>Status signal Active when FFC is in one of the receive states</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFOPCTRL</name>
          <description>FIFOP threshold</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOP_THR</name>
              <description>Threshold used when generating FIFOP signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSMCTRL</name>
          <description>FSM options</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SLOTTED_ACK</name>
              <description>Controls timing of transmission of acknowledge frames 0: The acknowledge frame is sent 12 symbol periods after the end of the received frame which requests the aknowledge. 1: The acknowledge frame is sent at the first backoff-slot boundary more than 12 symbol periods after the end of the received frame which requests the aknowledge. </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX2RX_TIME_OFF</name>
              <description>Defines whether or not a 12-symbol time-out should be used after frame reception has ended. 0: No time-out 1: 12-symbol-period time-out </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCACTRL0</name>
          <description>CCA threshold</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CCA_THR</name>
              <description>Clear-channel-assessment threshold value, signed 2's-complement number for comparison with the RSSI. The unit is 1 dB, offset is 73dB   The CCA signal goes high when the received signal is below this value. The CCA signal is available on the CCA pin and in the FSMSTAT1 register. The value must never be set lower than CCA_HYST - 128 to avoid erroneous behavior of the CCA signal. Note: The reset value translates to an input level of approximately -32 - 73 = -105 dBm, which is well below the sensitivity limit. This means that the CCA signal never indicates a clear channel. This register should be updated to 0xF8, which translates to an input level of about -8 - 73 = -81 dBm. </description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCACTRL1</name>
          <description>Other CCA Options</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CCA_MODE</name>
              <description>00: CCA always set to 1 01: CCA = 1 when RSSI &lt; CCA_THR - CCA_HYST; CCA = 0 when RSSI &gt;= CCA_THR 10: CCA = 1 when not receiving a frame, else CCA = 0 11: CCA = 1 when RSSI &lt; CCA_THR - CCA_HYST and not receiving a frame; CCA = 0 when RSSI &gt;= CCA_THR or when receiving a frame </description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCA_HYST</name>
              <description>Sets the level of CCA hysteresis. Unsigned values given in dB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSSI</name>
          <description>RSSI status register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RSSI_VAL</name>
              <description>RSSI estimate on a logarithmic scale, signed number on 2's complement Unit is 1 dB, offset is 73dB.  The RSSI value is averaged over eight symbol periods. The RSSI_VALID status bit should be checked before reading RSSI_VAL for the first time. The reset value of -128 also indicates that the RSSI value is invalid.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSSISTAT</name>
          <description>RSSI valid status register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RSSI_VALID</name>
              <description>RSSI value is valid. Occurs eight symbol periods after entering RX.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFIRST</name>
          <description>First byte in RX FIFO</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>First byte of the RX FIFO Note: Reading this register does not modify the contents of the FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFIFOCNT</name>
          <description>Number of bytes in RX FIFO</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXFIFOCNT</name>
              <description>Number of bytes in the RX FIFO (unsigned integer)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFIFOCNT</name>
          <description>Number of bytes in TX FIFO</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXFIFOCNT</name>
              <description>Number of bytes in the TX FIFO (unsigned integer)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFIRST_PTR</name>
          <description>RX FIFO pointer</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXFIRST_PTR</name>
              <description>RAM address offset of the first byte in the RX FIFO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXLAST_PTR</name>
          <description>RX FIFO pointer</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXLAST_PTR</name>
              <description>RAM address offset of the last byte + 1 byte in the RX FIFO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXP1_PTR</name>
          <description>RX FIFO pointer</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXP1_PTR</name>
              <description>RAM address offset of the first byte of the first frame in the RX FIFO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFIRST_PTR</name>
          <description>TX FIFO pointer</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXFIRST_PTR</name>
              <description>RAM address offset of the next byte to be transmitted from the TX FIFO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXLAST_PTR</name>
          <description>TX FIFO pointer</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXLAST_PTR</name>
              <description>RAM address offset of the last byte + 1 byte of the TX FIFO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RFIRQM0</name>
          <description>RF interrupt masks</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RFIRQM</name>
              <description>Bit mask is masking out interrupt sources. Bit position: 7: RXMASKZERO 6: RXPKTDONE 5: FRAME_ACCEPTED 4: SRC_MATCH_FOUND 3: SRC_MATCH_DONE 2: FIFOP 1: SFD 0: ACT_UNUSED </description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RFIRQM1</name>
          <description>RF interrupt masks</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RFIRQM</name>
              <description>Bit mask is masking out interrupt sources. Bit position: 5: CSP_WAIT 4: CSP_STOP 3: CSP_MANINT 2: RF_IDLE 1: TXDONE 0: TXACKDONE </description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RFERRM</name>
          <description>RF error interrupt mask</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RFERRM</name>
              <description>Bit mask is masking out interrupt sources. Bit position: 6: STROBE_ERR 5: TXUNDERF 4: TXOVERF 3: RXUNDERF 2: RXOVERF 1: RXABO 0: NLOCK </description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RFRND</name>
          <description>Random data</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>QRND</name>
              <description>Random bit from the Q channel of the receiver</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IRND</name>
              <description>Random bit from the I channel of the receiver</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MDMCTRL0</name>
          <description>Controls modem</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DEM_NUM_ZEROS</name>
              <description>Sets how many zero symbols must be detected before the sync word when searching for sync. Only one zero symbol is required to have a correlation value above the correlation threshold set in the MDMCTRL1 register. 00: Reserved 01: 1 zero symbol 10: 2 zero symbols 11: 3 zero symbols </description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEMOD_AVG_MODE</name>
              <description>Defines the behavior or the frequency offset averaging filter. 0: Lock average level after preamble match. Restart frequency offset calibration when searching for the next frame. 1: Continuously update average level.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PREAMBLE_LENGTH</name>
              <description>The number of preamble bytes (two zero-symbols) to be sent in TX mode before the SFD, encoded in steps of 2 symbols (1 byte). The reset value of 2 is compliant with IEEE 802.15.4. 0000: 2 leading-zero bytes 0001: 3 leading-zero bytes 0010: 4 leading-zero bytes ... 1111: 17 leading-zero bytes </description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_FILTER</name>
              <description>Defines the kind of TX filter that is used. The normal TX filter is as defined by the IEEE 802.15.4 standard. Extra filtering may be applied to lower the out-of-band emissions. 0: Normal TX filtering 1: Enable extra filtering</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MDMCTRL1</name>
          <description>Controls modem</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CORR_THR_SFD</name>
              <description>Defines requirements for SFD detection: 0: The correlation value of one of the zero symbols of the preamble must be above the correlation threshold. 1: The correlation value of one zero symbol of the preamble and both symbols in the SFD must be above the correlation threshold.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORR_THR</name>
              <description>Demodulator correlator threshold value, required before SFD search. Threshold value adjusts how the receiver synchronizes to data from the radio. If the threshold is set too low, sync can more easily be found on noise. If set too high, the sensitivity is reduced, but sync is not likely to be found on noise. In combination with DEM_NUM_ZEROS, the system can be tuned so sensitivity is high with less sync found on noise.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FREQEST</name>
          <description>Estimated RF frequency offset</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FREQEST</name>
              <description>Signed 2's-complement value. Contains an estimate of the frequency offset between carrier and the receiver LO. The offset frequency is FREQEST x 7800 Hz. DEM_AVG_MODE controls when this estimate is updated. If DEM_AVG_MODE = 0, it is updated until sync is found. Then the frequency offset estimate is frozen until the end of the received frame. If DEM_AVG_MODE = 1, it is updated as long as the demodulator is enabled. To calculate the correct value, one must use an offset (FREQEST_offset), which can be found in the device data sheet. Real FREQEST value = FREQEST - FREQEST_offset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCTRL</name>
          <description>Tune receive section</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>GBIAS_LNA2_REF</name>
              <description>Adjusts front-end LNA2/mixer PTAT current output (from M = 3 to M = 6), default: M = 5</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GBIAS_LNA_REF</name>
              <description>Adjusts front-end LNA PTAT current output (from M = 3 to M = 6), default: M = 5</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MIX_CURRENT</name>
              <description>Control of the output current from the receiver mixers  The current increases with increasing setting set.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
