drone-os/drone-tisl-map/svd_files/CC2538.svd
        <register>
          <name>RFIRQF1</name>
          <description>RF interrupt flags</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CSP_WAIT</name>
              <description>Execution continued after a wait instruction in CSP. 0: No interrupt pending 1: Interrupt pending</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSP_STOP</name>
              <description>CSP has stopped program execution. 0: No interrupt pending 1: Interrupt pending</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSP_MANINT</name>
              <description>Manual interrupt generated from CSP 0: No interrupt pending 1: Interrupt pending</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFIDLE</name>
              <description>Radio state-machine has entered the IDLE state. 0: No interrupt pending 1: Interrupt pending</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXDONE</name>
              <description>A complete frame has been transmitted. 0: No interrupt pending 1: Interrupt pending</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXACKDONE</name>
              <description>An acknowledgement frame has been completely transmitted. 0: No interrupt pending 1: Interrupt pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RFIRQF0</name>
          <description>RF interrupt flags</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXMASKZERO</name>
              <description>The RXENABLE register has gone from a nonzero state to an all-zero state. 0: No interrupt pending 1: Interrupt pending</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXPKTDONE</name>
              <description>A complete frame has been received. 0: No interrupt pending 1: Interrupt pending</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAME_ACCEPTED</name>
              <description>Frame has passed frame filtering. 0: No interrupt pending 1: Interrupt pending</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRC_MATCH_FOUND</name>
              <description>Source match is found. 0: No interrupt pending 1: Interrupt pending</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRC_MATCH_DONE</name>
              <description>Source matching is complete. 0: No interrupt pending 1: Interrupt pending</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFOP</name>
              <description>The number of bytes in the RX FIFO is greater than the threshold. Also raised when a complete frame is received, and when a packet is read out completely and more complete packets are available. 0: No interrupt pending 1: Interrupt pending</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SFD</name>
              <description>SFD has been received or transmitted. 0: No interrupt pending 1: Interrupt pending</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACT_UNUSED</name>
              <description>Reserved 0: No interrupt pending 1: Interrupt pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RFST</name>
          <description>RF CSMA-CA/strobe processor</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>INSTR</name>
              <description>Data written to this register is written to the CSP instruction memory. Reading this register returns the CSP instruction currently being executed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>USB</name>
      <description>no description available</description>
      <groupName>USB</groupName>
      <baseAddress>0x40089000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ADDR</name>
          <description>Function address</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>UPDATE</name>
              <description>This bit is set by hardware when writing to this register, and is cleared by hardware when the new address becomes effective.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USBADDR</name>
              <description>Device address.  The address shall be updated upon successful completion of the status stage of the SET_ADDRESS request.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>POW</name>
          <description>Power management and control register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ISOWAITSOF</name>
              <description>For isochronous mode IN endpoints: When set,  the USB controller will wait for an SOF token from the time USB_CSIL.INPKTRDY is set before sending the packet. If an IN token is received before an SOF token, then a zero length data packet will be sent.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RST</name>
              <description>Indicates that reset signaling is present on the bus</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RESUME</name>
              <description>Drives resume signaling for remote wakeup According to the USB Specification, the resume signal must be held active for at least 1 ms and no more than 15 ms. It is recommended to keep this bit set for approximately 10 ms.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUSPEND</name>
              <description>Indicates entry into suspend mode Suspend mode must be enabled by setting USB_POW.SUSPENDEN Software clears this bit by reading the USB_CIF register or by asserting USB_POW.RESUME</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SUSPENDEN</name>
              <description>Enables detection of and entry into suspend mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IIF</name>
          <description>Interrupt flags for endpoint 0 and IN endpoints 1-5</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>INEP5IF</name>
              <description>Interrupt flag for IN endpoint 5 Cleared by hardware when read</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INEP4IF</name>
              <description>Interrupt flag for IN endpoint 4 Cleared by hardware when read</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INEP3IF</name>
              <description>Interrupt flag for IN endpoint 3 Cleared by hardware when read</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INEP2IF</name>
              <description>Interrupt flag for IN endpoint 2 Cleared by hardware when read</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INEP1IF</name>
              <description>Interrupt flag for IN endpoint 1 Cleared by hardware when read</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EP0IF</name>
              <description>Interrupt flag for endpoint 0 Cleared by hardware when read</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OIF</name>
          <description>Interrupt flags for OUT endpoints 1-5</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OUTEP5IF</name>
              <description>Interrupt flag for OUT endpoint 5 Cleared by hardware when read</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTEP4IF</name>
              <description>Interrupt flag for OUT endpoint 4 Cleared by hardware when read</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTEP3IF</name>
              <description>Interrupt flag for OUT endpoint 3 Cleared by hardware when read</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTEP2IF</name>
              <description>Interrupt flag for OUT endpoint 2 Cleared by hardware when read</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTEP1IF</name>
              <description>Interrupt flag for OUT endpoint 1 Cleared by hardware when read</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIF</name>
          <description>Common USB interrupt flags</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SOFIF</name>
              <description>Start-of-frame interrupt flag Cleared by hardware when read</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSTIF</name>
              <description>Reset interrupt flag Cleared by hardware when read</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RESUMEIF</name>
              <description>Resume interrupt flag Cleared by hardware when read</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SUSPENDIF</name>
              <description>Suspend interrupt flag Cleared by hardware when read</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IIE</name>
          <description>Interrupt enable mask for IN endpoints 1-5 and endpoint 0</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>INEP5IE</name>
              <description>Interrupt enable for IN endpoint 5 0: Interrupt disabled 1: Interrupt enabled</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEP4IE</name>
              <description>Interrupt enable for IN endpoint 4 0: Interrupt disabled 1: Interrupt enabled</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEP3IE</name>
              <description>Interrupt enable for IN endpoint 3 0: Interrupt disabled 1: Interrupt enabled</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEP2IE</name>
              <description>Interrupt enable for IN endpoint 2 0: Interrupt disabled 1: Interrupt enabled</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEP1IE</name>
              <description>Interrupt enable for IN endpoint 1 0: Interrupt disabled 1: Interrupt enabled</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EP0IE</name>
              <description>Interrupt enable for endpoint 0 0: Interrupt disabled 1: Interrupt enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OIE</name>
          <description>Interrupt enable mask for OUT endpoints 1-5</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OUTEP5IE</name>
              <description>Interrupt enable for OUT endpoint 5 0: Interrupt disabled 1: Interrupt enabled</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTEP4IE</name>
              <description>Interrupt enable for OUT endpoint 4 0: Interrupt disabled 1: Interrupt enabled</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTEP3IE</name>
              <description>Interrupt enable for OUT endpoint 3 0: Interrupt disabled 1: Interrupt enabled</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTEP2IE</name>
              <description>Interrupt enable for OUT endpoint 2 0: Interrupt disabled 1: Interrupt enabled</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTEP1IE</name>
              <description>Interrupt enable for OUT endpoint 1 0: Interrupt disabled 1: Interrupt enabled</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIE</name>
          <description>Common USB interrupt enable mask</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SOFIE</name>
              <description>Start-of-frame interrupt enable 0: Interrupt disabled 1: Interrupt enabled</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTIE</name>
              <description>Reset interrupt enable 0: Interrupt disabled 1: Interrupt enabled</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESUMEIE</name>
              <description>Resume interrupt enable 0: Interrupt disabled 1: Interrupt enabled</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUSPENDIE</name>
              <description>Suspend interrupt enable 0: Interrupt disabled 1: Interrupt enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FRML</name>
          <description>Frame number (low byte)</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FRAMEL</name>
              <description>Bits 7:0 of the 11-bit frame number The frame number is only updated upon successful reception of SOF tokens</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FRMH</name>
          <description>Frame number (high byte)</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FRAMEH</name>
              <description>Bits 10:8 of the 11-bit frame number The frame number is only updated upon successful reception of SOF tokens</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INDEX</name>
          <description>Index register for selecting the endpoint status and control registers</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>USBINDEX</name>
              <description>Index of the currently selected endpoint The index is set to 0 to enable access to endpoint 0 control and status registers The index is set to 1, 2, 3, 4 or 5 to enable access to IN/OUT endpoint 1, 2, 3, 4 or 5 control and status registers, respectively </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
