drone-os/drone-tisl-map/svd_files/CC2538.svd
        <register>
          <name>DCGCSEC</name>
          <description>This register defines the module clocks for the security module when the CPU is in PM0. This register setting is don't care for PM1-3, because the system clock is powered down in these modes.</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>AES</name>
              <description>0: Clock for AES is gated. 1: Clock for AES is enabled.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKA</name>
              <description>0: Clock for PKA is gated. 1: Clock for PKA is enabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRSEC</name>
          <description>This register controls the reset for the security module.</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>AES</name>
              <description>0: AES module is not reset 1: AES module is reset </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKA</name>
              <description>0: PKA module is not reset 1: PKA module is reset </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMCTL</name>
          <description>This register controls the power mode. Note: The Corresponding PM is not entered before the WFI instruction is asserted. To enter PM1-3 the DEEPSLEEP bit in SYSCTRL must be 1.</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PM</name>
              <description>00: No action 01: PM1 10: PM2 11: PM3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCRC</name>
          <description>This register controls CRC on state retention.</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CRC_REN_USB</name>
              <description>1: Enable reset of chip if CRC fails. 0: Disable reset feature of chip due to CRC.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRC_REN_RF</name>
              <description>1: Enable reset of chip if CRC fails. 0: Disable reset feature of chip due to CRC.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRDBG</name>
          <description>Power debug register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FORCE_WARM_RESET</name>
              <description>0: No action 1: When written high, the chip is reset in the same manner as a CLD event and is readable from the RST field in the CLOCK_STA register.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLD</name>
          <description>This register controls the clock loss detection feature.</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VALID</name>
              <description>0: CLD status in always-on domain is not equal to status in the EN register. 1: CLD status in always-on domain and EN register are equal.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EN</name>
              <description>0: CLD is disabled. 1: CLD is enabled. Writing to this register shall be ignored if VALID = 0 </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IWE</name>
          <description>This register controls interrupt wake-up.</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SM_TIMER_IWE</name>
              <description>1: Enable SM Timer wake-up interrupt. 0: Disable SM Timer wake-up interrupt.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_IWE</name>
              <description>1: Enable USB wake-up interrupt. 0: Disable USB wake-up interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORT_D_IWE</name>
              <description>1: Enable port D wake-up interrupt. 0: Disable port D wake-up interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORT_C_IWE</name>
              <description>1: Enable port C wake-up interrupt. 0: Disable port C wake-up interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORT_B_IWE</name>
              <description>1: Enable port B wake-up interrupt. 0: Disable port B wake-up interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORT_A_IWE</name>
              <description>1: Enable port A wake-up interrupt. 0: Disable port A wake-up interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I_MAP</name>
          <description>This register selects which interrupt map to be used.</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ALTMAP</name>
              <description>1: Select alternate interrupt map. 0: Select regular interrupt map. (See the ASD document for details.)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCRFC</name>
          <description>This register defines the module clocks for RF CORE when the CPU is in active (run) mode. This register setting is don't care for PM1-3, because the system clock is powered down in these modes.</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RFC0</name>
              <description>0: Clock for RF CORE is gated. 1: Clock for RF CORE is enabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCRFC</name>
          <description>This register defines the module clocks for RF CORE when the CPU is in sleep mode. This register setting is don't care for PM1-3, because the system clock is powered down in these modes.</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RFC0</name>
              <description>0: Clock for RF CORE is gated. 1: Clock for RF CORE is enabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCRFC</name>
          <description>This register defines the module clocks for RF CORE when the CPU is in PM0. This register setting is don't care for PM1-3, because the system clock is powered down in these modes.</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RFC0</name>
              <description>0: Clock for RF CORE is gated. 1: Clock for RF CORE is enabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMUOVR</name>
          <description>This register defines the emulator override controls for power mode and peripheral clock gate.</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ICEPICK_FORCE_CLOCK_CG</name>
              <description>ICEPick 'Force Active' clock gate override bit. 'Force Active' is an ICEPick command.  1 --&gt; In non-sleep power mode, peripherals clocks are forced to follow RCG* register settings. It forces CM3 clocks on.  0 --&gt; Does not affect the peripheral clock settings. </description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICEPICK_FORCE_POWER_CG</name>
              <description>ICEPick 'Force Power' clock gate override bit. 'Force Power' is an ICEPick command.  1 --&gt; In non-sleep power mode, peripherals clocks are forced to follow RCG* register settings. It forces CM3 clocks on.  0 --&gt; Does not affect the peripheral clock settings. </description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICEPICK_INHIBIT_SLEEP_CG</name>
              <description>ICEPick 'Inhibit Sleep' clock gate override bit. 'Inhibit Sleep' is an ICEPick command.  1 --&gt; In non-sleep power mode, peripherals clocks are forced to follow RCG* register settings. It forces CM3 clocks on.  0 --&gt; Does not affect the peripheral clock settings. </description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICEMELTER_WKUP_CG</name>
              <description>ICEMelter 'WAKEUPEMU' clock gate override bit.  1 --&gt; In non-sleep power mode, peripherals clocks are forced to follow RCG* register settings. It forces CM3 clocks on.  0 --&gt; Does not affect the peripheral clock settings</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICEPICK_FORCE_CLOCK_PM</name>
              <description>ICEPick 'Force Active' power mode override bit. 'Force Active' is an ICEPick command.  1 --&gt; Prohibit the system to go into any power down modes. Keeps the emulator attached. 0 --&gt; Does not override any power mode settings from SYSREGS and does not prohibit system to go into any power down modes. </description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICEPICK_FORCE_POWER_PM</name>
              <description>ICEPick 'Force Power' power mode override bit. 'Force Power' is an ICEPick command.  1 --&gt; Prohibit the system to go into any power down modes. Keeps the emulator attached. 0 --&gt; Does not override any power mode settings from SYSREGS and does not prohibit system to go into any power down modes. </description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICEPICK_INHIBIT_SLEEP_PM</name>
              <description>ICEPick 'Inhibit Sleep' power mode override bit. 'Inhibit Sleep' is an ICEPick command.  1 --&gt; Prohibit the system to go into any power down modes. Keeps the emulator attached. 0 --&gt; Does not override any power mode settings from SYSREGS and does not prohibit system to go into any power down modes.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICEMELTER_WKUP_PM</name>
              <description>ICEMelter 'WAKEUPEMU' power mode override bit.  1 --&gt; Prohibit the system to go into any power down modes. Keeps the emulator attached. 0 --&gt; Does not override any power mode settings from SYSREGS and does not prohibit system to go into any power down modes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
