drone-os/drone-tisl-map/svd_files/CC2538.svd
        <register>
          <name>P_EDGE_CTRL</name>
          <description>The port edge control register is used to control which edge of each port input causes that port to generate a power-up interrupt to the system.</description>
          <addressOffset>0x704</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PDIRC7</name>
              <description>Port D bit 7 interrupt request condition: 0: Rising 1: Falling edge</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDIRC6</name>
              <description>Port D bit 6 interrupt request condition: 0: Rising 1: Falling edge</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDIRC5</name>
              <description>Port D bit 5 interrupt request condition: 0: Rising 1: Falling edge</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDIRC4</name>
              <description>Port D bit 4 interrupt request condition: 0: Rising 1: Falling edge</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDIRC3</name>
              <description>Port D bit 3 interrupt request condition: 0: Rising 1: Falling edge</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDIRC2</name>
              <description>Port D bit 2 interrupt request condition: 0: Rising 1: Falling edge</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDIRC1</name>
              <description>Port D bit 1 interrupt request condition: 0: Rising 1: Falling edge</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDIRC0</name>
              <description>Port D bit 0 interrupt request condition: 0: Rising 1: Falling edge</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIRC7</name>
              <description>Port C bit 7 interrupt request condition: 0: Rising 1: Falling edge</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIRC6</name>
              <description>Port C bit 6 interrupt request condition: 0: Rising 1: Falling edge</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIRC5</name>
              <description>Port C bit 5 interrupt request condition: 0: Rising 1: Falling edge</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIRC4</name>
              <description>Port C bit 4 interrupt request condition: 0: Rising 1: Falling edge</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIRC3</name>
              <description>Port C bit 3 interrupt request condition: 0: Rising 1: Falling edge</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIRC2</name>
              <description>Port C bit 2 interrupt request condition: 0: Rising 1: Falling edge</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIRC1</name>
              <description>Port C bit 1 interrupt request condition: 0: Rising 1: Falling edge</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIRC0</name>
              <description>Port C bit 0 interrupt request condition: 0: Rising 1: Falling edge</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBIRC7</name>
              <description>Port B bit 7 interrupt request condition: 0: Rising 1: Falling edge</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBIRC6</name>
              <description>Port B bit 6 interrupt request condition: 0: Rising 1: Falling edge</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBIRC5</name>
              <description>Port B bit 5 interrupt request condition: 0: Rising 1: Falling edge</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBIRC4</name>
              <description>Port B bit 4 interrupt request condition: 0: Rising 1: Falling edge</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBIRC3</name>
              <description>Port B bit 3 interrupt request condition: 0: Rising 1: Falling edge</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBIRC2</name>
              <description>Port B bit 2 interrupt request condition: 0: Rising 1: Falling edge</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBIRC1</name>
              <description>Port B bit 1 interrupt request condition: 0: Rising 1: Falling edge</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBIRC0</name>
              <description>Port B bit 0 interrupt request condition: 0: Rising 1: Falling edge</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAIRC7</name>
              <description>Port A bit 7 interrupt request condition: 0: Rising 1: Falling edge</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAIRC6</name>
              <description>Port A bit 6 interrupt request condition: 0: Rising 1: Falling edge</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAIRC5</name>
              <description>Port A bit 5 interrupt request condition: 0: Rising 1: Falling edge</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAIRC4</name>
              <description>Port A bit 4 interrupt request condition: 0: Rising 1: Falling edge</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAIRC3</name>
              <description>Port A bit 3 interrupt request condition: 0: Rising 1: Falling edge</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAIRC2</name>
              <description>Port A bit 2 interrupt request condition: 0: Rising 1: Falling edge</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAIRC1</name>
              <description>Port A bit 1 interrupt request condition: 0: Rising 1: Falling edge</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAIRC0</name>
              <description>Port A bit 0 interrupt request condition: 0: Rising 1: Falling edge</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_CTRL</name>
          <description>This register is used to control which edge of the USB controller input generates a power-up interrupt to the system.</description>
          <addressOffset>0x708</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>USB_EDGE_CTL</name>
              <description>Used to set the edge which triggers the USB power up interrupt 0: Rising 1: Falling</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PI_IEN</name>
          <description>The power-up interrupt enable register selects, for its corresponding port A-D pin, whether interrupts are enabled or disabled.</description>
          <addressOffset>0x710</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PDIEN7</name>
              <description>Port D bit 7 interrupt enable: 1: Enabled 2: Disabled</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDIEN6</name>
              <description>Port D bit 6 interrupt enable: 1: Enabled 2: Disabled</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDIEN5</name>
              <description>Port D bit 5 interrupt enable: 1: Enabled 2: Disabled</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDIEN4</name>
              <description>Port D bit 4 interrupt enable: 1: Enabled 2: Disabled</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDIEN3</name>
              <description>Port D bit 3 interrupt enable: 1: Enabled 2: Disabled</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDIEN2</name>
              <description>Port D bit 2 interrupt enable: 1: Enabled 2: Disabled</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDIEN1</name>
              <description>Port D bit 1 interrupt enable: 1: Enabled 2: Disabled</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDIEN0</name>
              <description>Port D bit 0 interrupt enable: 1: Enabled 2: Disabled</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIEN7</name>
              <description>Port C bit 7 interrupt enable: 1: Enabled 2: Disabled</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIEN6</name>
              <description>Port C bit 6 interrupt enable: 1: Enabled 2: Disabled</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIEN5</name>
              <description>Port C bit 5 interrupt enable: 1: Enabled 2: Disabled</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIEN4</name>
              <description>Port C bit 4 interrupt enable: 1: Enabled 2: Disabled</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIEN3</name>
              <description>Port C bit 3 interrupt enable: 1: Enabled 2: Disabled</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIEN2</name>
              <description>Port C bit 2 interrupt enable: 1: Enabled 2: Disabled</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIEN1</name>
              <description>Port C bit 1 interrupt enable: 1: Enabled 2: Disabled</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIEN0</name>
              <description>Port C bit 0 interrupt enable: 1: Enabled 2: Disabled</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBIEN7</name>
              <description>Port B bit 7 interrupt enable: 1: Enabled 2: Disabled</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBIEN6</name>
              <description>Port B bit 6 interrupt enable: 1: Enabled 2: Disabled</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBIEN5</name>
              <description>Port B bit 5 interrupt enable: 1: Enabled 2: Disabled</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBIEN4</name>
              <description>Port B bit 4 interrupt enable: 1: Enabled 2: Disabled</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBIEN3</name>
              <description>Port B bit 3 interrupt enable: 1: Enabled 2: Disabled</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBIEN2</name>
              <description>Port B bit 2 interrupt enable: 1: Enabled 2: Disabled</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBIEN1</name>
              <description>Port B bit 1 interrupt enable: 1: Enabled 2: Disabled</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBIEN0</name>
              <description>Port B bit 0 interrupt enable: 1: Enabled 2: Disabled</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAIEN7</name>
              <description>Port A bit 7 interrupt enable: 1: Enabled 2: Disabled</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAIEN6</name>
              <description>Port A bit 6 interrupt enable: 1: Enabled 2: Disabled</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAIEN5</name>
              <description>Port A bit 5 interrupt enable: 1: Enabled 2: Disabled</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAIEN4</name>
              <description>Port A bit 4 interrupt enable: 1: Enabled 2: Disabled</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAIEN3</name>
              <description>Port A bit 3 interrupt enable: 1: Enabled 2: Disabled</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAIEN2</name>
              <description>Port A bit 2 interrupt enable: 1: Enabled 2: Disabled</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAIEN1</name>
              <description>Port A bit 1 interrupt enable: 1: Enabled 2: Disabled</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAIEN0</name>
              <description>Port A bit 0 interrupt enable: 1: Enabled 2: Disabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
