drone-os/drone-tisl-map/svd_files/CC2538.svd
        <register>
          <name>CHMAP0</name>
          <description>DMA channel map select 0 Each 4-bit field of the CHMAP0 register configures the uDMA channel assignment as specified in the uDMA channel assignment table in the "Channel Assignments" section.</description>
          <addressOffset>0x510</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CH7SEL</name>
              <description>uDMA channel 7 source select See section titled "Channel Assignments" in Micro Direct Memory Access chapter.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH6SEL</name>
              <description>uDMA channel 6 source select See section titled "Channel Assignments" in Micro Direct Memory Access chapter.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH5SEL</name>
              <description>uDMA channel 5 source select See section titled "Channel Assignments" in Micro Direct Memory Access chapter.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4SEL</name>
              <description>uDMA channel 4 source select See section titled "Channel Assignments" in Micro Direct Memory Access chapter.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3SEL</name>
              <description>uDMA channel 3 source select See section titled "Channel Assignments" in Micro Direct Memory Access chapter.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2SEL</name>
              <description>uDMA channel 2 source select See section titled "Channel Assignments" in Micro Direct Memory Access chapter.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1SEL</name>
              <description>uDMA channel 1 source select See section titled "Channel Assignments" in Micro Direct Memory Access chapter.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0SEL</name>
              <description>uDMA channel 0 source select See section titled "Channel Assignments" in Micro Direct Memory Access chapter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHMAP1</name>
          <description>DMA channel map select 1 Each 4-bit field of the CHMAP1 register configures the uDMA channel assignment as specified in the uDMA channel assignment table in the "Channel Assignments" section.</description>
          <addressOffset>0x514</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CH15SEL</name>
              <description>uDMA channel 15 source select See section titled "Channel Assignments" in Micro Direct Memory Access chapter.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH14SEL</name>
              <description>uDMA channel 14 source select See section titled "Channel Assignments" in Micro Direct Memory Access chapter.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH13SEL</name>
              <description>uDMA channel 13 source select See section titled "Channel Assignments" in Micro Direct Memory Access chapter.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH12SEL</name>
              <description>uDMA channel 12 source select See section titled "Channel Assignments" in Micro Direct Memory Access chapter.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH11SEL</name>
              <description>uDMA channel 11 source select See section titled "Channel Assignments" in Micro Direct Memory Access chapter.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH10SEL</name>
              <description>uDMA channel 10 source select See section titled "Channel Assignments" in Micro Direct Memory Access chapter.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH9SEL</name>
              <description>uDMA channel 9 source select See section titled "Channel Assignments" in Micro Direct Memory Access chapter.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH8SEL</name>
              <description>uDMA channel 8 source select See section titled "Channel Assignments" in Micro Direct Memory Access chapter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHMAP2</name>
          <description>DMA channel map select 2 Each 4-bit field of the CHMAP2 register configures the uDMA channel assignment as specified in the uDMA channel assignment table in the "Channel Assignments" section.</description>
          <addressOffset>0x518</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CH23SEL</name>
              <description>uDMA channel 23 source select See section titled "Channel Assignments" in Micro Direct Memory Access chapter.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH22SEL</name>
              <description>uDMA channel 22 source select See section titled "Channel Assignments" in Micro Direct Memory Access chapter.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH21SEL</name>
              <description>uDMA channel 21 source select See section titled "Channel Assignments" in Micro Direct Memory Access chapter.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH20SEL</name>
              <description>uDMA channel 20 source select See section titled "Channel Assignments" in Micro Direct Memory Access chapter.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH19SEL</name>
              <description>uDMA channel 19 source select See section titled "Channel Assignments" in Micro Direct Memory Access chapter.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH18SEL</name>
              <description>uDMA channel 18 source select See section titled "Channel Assignments" in Micro Direct Memory Access chapter.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH17SEL</name>
              <description>uDMA channel 17 source select See section titled "Channel Assignments" in Micro Direct Memory Access chapter.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH16SEL</name>
              <description>uDMA channel 16 source select See section titled "Channel Assignments" in Micro Direct Memory Access chapter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHMAP3</name>
          <description>DMA channel map select 3 Each 4-bit field of the CHMAP3 register configures the uDMA channel assignment as specified in the uDMA channel assignment table in the "Channel Assignments" section.</description>
          <addressOffset>0x51c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CH31SEL</name>
              <description>uDMA channel 31 source select See section titled "Channel Assignments" in Micro Direct Memory Access chapter.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH30SEL</name>
              <description>uDMA channel 30 source select See section titled "Channel Assignments" in Micro Direct Memory Access chapter.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH29SEL</name>
              <description>uDMA channel 29 source select See section titled "Channel Assignments" in Micro Direct Memory Access chapter.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH28SEL</name>
              <description>uDMA channel 28 source select See section titled "Channel Assignments" in Micro Direct Memory Access chapter.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH27SEL</name>
              <description>uDMA channel 27 source select See section titled "Channel Assignments" in Micro Direct Memory Access chapter.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH26SEL</name>
              <description>uDMA channel 26 source select See section titled "Channel Assignments" in Micro Direct Memory Access chapter.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH25SEL</name>
              <description>uDMA channel 25 source select See section titled "Channel Assignments" in Micro Direct Memory Access chapter.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH24SEL</name>
              <description>uDMA channel 24 source select See section titled "Channel Assignments" in Micro Direct Memory Access chapter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
